export const PRIVACY_POLICY_TEMPLATE = {
  privacyPolicyTitle: "Управління налаштуваннями",
  subTitle:
    "Ми використовуємо дані клієнта, щоб покращити роботу нашого сервісу та показувати рекламні акції, які можуть становити для вас інтерес.",
  description:
    "Glovo може ділитися даними користувачів (наприклад, хешовані електронні листи, телефони або ідентифікатори пристроїв) із Facebook та подібними платформами для персоналізації та аналізу ефективності реклами та контенту, а також для створення аудиторій. Ви завжди можете відмовитися від отримання таких повідомлень, вимкнувши цей перемикач.",
  pushMessageTitle:
    "Получать информацию о специальных предложениях и промоакциях",
};
