type buttonT = "Редагувати" | "Створити" | "Додати " | "Вийти";

const buttonVariant: buttonT[] = ["Редагувати", "Вийти", "Створити", "Додати "];

export const HEADER_USER_ORDERS_TEMPLATE = {
  title: "Вітаємо USERNAME",
  info: [
    { name: "Іm'я", email: "Адреса ел.пошти", button: buttonVariant[0] },
    {
      phone: "Телефон",
      placeholder: "Ваш номер телефону?",
    },
    { password: "Пароль" },
    {
      paymentMethod: "Спосіб оплати",
      buttonText: "Додати нову картку",
      infoAboutComp: "Інформація про компанію",
      button: buttonVariant[2],
    },
    {
      title: "Управління налаштуваннями",
      subTitle:
        "Ми використовуємо дані клієнта, щоб покращити роботу нашого сервісу та показувати рекламні акції, які можуть становити для вас інтерес.",
      pushTitle: "Получать информацию о специальных предложениях и промоакциях",
      descr: `Glovo може ділитися даними користувачів (наприклад, хешовані
          електронні листи, телефони або ідентифікатори пристроїв) із
          Facebook та подібними платформами для персоналізації та аналізу
          ефективності реклами та контенту, а також для створення
          аудиторій. Ви завжди можете відмовитися від отримання таких
          повідомлень, вимкнувши цей перемикач.`,
    },
    { promocode: "Промокод", button: buttonVariant[3] },
  ],
  exit: buttonVariant[1],
};

const HEADER_USER_ORDERS_DATA = {};
